IDEA StatiCa Open Model
LoadGroupType Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Load group type
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum LoadGroupType
Public Enumeration LoadGroupType
public enum class LoadGroupType
Members
Member name | Value | Description
Permanent | 0 |  Permanent
Variable | 1 |  Variable
Accidental | 2 |  Accidental
Seismic | 3 |  Seismic
Fatigue | 4 |  Fatigue
See Also
Reference
IdeaRS.OpenModel.Loading Namespace